{"inkVersion":21,"root":[[{"->":"ball"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"all_clues":["ev",{"VAR?":"clue_1"},{"VAR?":"clue_2"},"&&",{"VAR?":"clue_3"},"&&",{"f()":"clue_4"},"&&","/ev","~ret","\n",{"#f":1}],"clue_4":["ev",{"VAR?":"clue_4_1"},{"VAR?":"clue_4_2"},"&&","/ev","~ret",{"#f":1}],"any_clue":["ev",{"VAR?":"clue_1"},{"VAR?":"clue_2"},"||",{"VAR?":"clue_3"},"||",{"VAR?":"clue_4_1"},"||",{"VAR?":"clue_4_2"},"||","/ev","~ret",{"#f":1}],"realtime":["ev",{"VAR?":"soln_time"},"/ev",["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev","str","^7:05","/str","/ev","~ret",{"->":".^.^.^.8"},null]}],["du","ev",2,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev","str","^7:15","/str","/ev","~ret",{"->":".^.^.^.8"},null]}],["du","ev",3,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev","str","^7:25","/str","/ev","~ret",{"->":".^.^.^.8"},null]}],["du","ev",4,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev","str","^7:35","/str","/ev","~ret",{"->":".^.^.^.8"},null]}],[{"->":".^.b"},{"b":["pop","\n","ev","str","^","/str","/ev","~ret",{"->":".^.^.^.8"},null]}],"nop","\n",{"#f":1}],"numbered":[{"temp=":"int"},"ev",{"VAR?":"int"},"/ev",["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev","str","^first","/str","/ev","~ret",{"->":".^.^.^.9"},null]}],["du","ev",2,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev","str","^second","/str","/ev","~ret",{"->":".^.^.^.9"},null]}],["du","ev",3,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev","str","^third","/str","/ev","~ret",{"->":".^.^.^.9"},null]}],["du","ev",4,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","ev","str","^fourth","/str","/ev","~ret",{"->":".^.^.^.9"},null]}],[{"->":".^.b"},{"b":["pop","\n","ev","str","^","/str","/ev","~ret",{"->":".^.^.^.9"},null]}],"nop","\n",{"#f":1}],"FINAL":[["ev",true,"/ev",{"VAR=":"puzzle_solved","re":true},"^After taking all the witness statements, you notice that the hands of the clock on the mantelpiece have not moved. When you examine it more closely, you realize that the glass on the clock face is also slightly cracked, suggesting it was knocked over recently. The clock is also right next to the bust where the necklace was resting, so you realize it is likely that it was knocked over by the culprit. The maid and Lady Rose confirm that the clock was working at the time the dancing started, confirming your suspicions. The time on the broken clock is stuck at 7:09, during the fourth dance - the Quickstep.","\n","ev","str","^Eleanor","/str","/ev",{"VAR=":"soln_suspect","re":true},"^You know from the information you have already collected, that the culprit must be Lady Eleanor Appleton.","\n","ev","str","^Accuse Lady Eleanor","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ You accuse Lady Eleanor. ",{"->":"accuse"},"\n",{"#f":5}]}],{"#f":1}],"solved":[["ev",true,"/ev",{"VAR=":"puzzle_solved","re":true},"^Eureka! You've figured out the order of the dances and who sat out which. With this information, all you need to know is what time the necklace was stolen. You should check the bust ","ev",{"CNT?":"ball.bust"},"/ev",[{"->":".^.b","c":true},{"b":["^ again ",{"->":".^.^.^.9"},null]}],"nop","^for clues to the time.","\n","ev","str","^Bust","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"ball.bust"},"\n",{"#f":5}]}],{"#f":1}],"accuse":["ev",{"VAR?":"soln_suspect"},"/ev",["du","ev","str","^Eleanor","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^\"You cannot honestly believe that I would steal? From my own dear sister?\" she yells back indignantly. \"Ok, fine. But it isn’t really stealing so much as taking my due as the eldest sister. I’m certain our mother meant for me to have it really, or she would have if my sister had not schemed for it to be given to her ‘as a wedding present’. But really, Rose has had it these past twenty years, and it’s well past time I had a turn, don’t you think?\"","\n",{"->":"accuse.8"},null]}],["du","ev","str","^Baker","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^\"Steal Lady Rose’s necklace for Lady Eleanor? Hah! One of the few joys I have is seeing Lady Eleanor’s envy over that necklace. She has everything a person could possibly want, and she behaves as though the world owes her more and more! Whereas I am utterly dependent on others for the most basic necessities. That necklace will secure me a comfortable life away from her and the rest of this self satisfied group [gasps from the rest of the party]. Fine, I admit it! While the maid’s attention was on my ripped dress, I saw the opportunity for a better life and I took it! Can you really blame me?\"","\n",{"->":"accuse.8"},null]}],["du","ev","str","^George","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^\"Me?\" Lord George swells in outrage, \"What use could I, a titled lord, have for such a frippery?\" he demands.","\n","^\"Perhaps to buoy up your failing stocks?\" you suggest.","\n","^\"My failing stocks?\" He deflates rapidly.","\n","^\"...Ahem, well, perhaps the thing was ill advised. I just saw it sitting there and thought that I could pay for months of repairs with the gold and rubies alone, to say nothing of the diamonds… [addressing Lady Rose] I daresay I’m sorry, old thing. It was just a sudden fancy. I’m sure I would have returned it soon enough.\"","\n",{"->":"accuse.8"},null]}],["du","ev","str","^Parker","/str","==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^\"I realize I am new to town, so you must find me a convenient scapegoat for this theft, but I assure you I had nothing to do with this. In any case, what use could I have for such a feminine bauble? To sell? My esteemed family of...Wervershire keep me well provided for.\"","\n","^\"Wervershire?\" you repeat, \"I'm fairly certain there is no such county.\"","\n","^\"Wervershire isn’t a real place?... Fine. I took the necklace. I couldn’t resist such an easy target! Sitting in plain view for anyone to grab! I only regret that I didn’t have a fake made ahead of time. Then I could’ve gotten away with it before anyone noticed it missing.\"","\n",{"->":"accuse.8"},null]}],[{"->":".^.b"},{"b":["pop","\n","^Something has gone horribly wrong in your code!","\n","^THE END","\n","end",{"->":"accuse.8"},null]}],"nop","\n",{"#f":1}],"ball":["^<b><i>Lady Rose's Chrysanthemum Ball</i></b>","\n","^The most anticipated event of the season is always your cousin Lady Rose’s Chrysanthemum Ball, and this year is no exception. You’ve spent weeks assembling the perfect outfit, practicing your social dances, and memorizing details about the illustrious attendees calculated to make the best impression.","\n","ev",{"^->":"ball"},"/ev",{"VAR=":"from","re":true},{"->":".^.outside"},{"outside":[["^<b>Outside the Manor</b>","\n","ev",{"^->":"ball.outside"},"/ev",{"VAR=":"from","re":true},"ev","str","^Knock on door","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^You knock on the door to the manor.","\n","^An imposing butler wearing a uniform so starched you suspect it would stand up without him answers the door.","\n","^\"Good evening miss. I'm afraid there has been an unfortunate incident, and the ball has been cancelled. Lady Rose gives her deepest regrets that we were not able to contact you in time to save your journey.\" The butler starts to close the door again at the finale of this clearly rehearsed speech.","\n","^\"Wait!\" You put your body in the way of the closing door, and he looks at you like you've just grown a second head.","\n","^\"What kind of an incident? Has someone fallen ill? Lady Rose is my cousin, and I want to be able to help if I can.\" The butler is clearly torn between his orders to turn guests away and the uncertainty about whether you qualify as a \"guest\".","\n","^\"Come for now,\" he says, letting you in. \"I'll confer with Lady Rose. Please wait here a moment.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["ev","str","^Foyer","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n",{"->":"ball.foyer"},{"#f":5}],"#f":5}]}],{"#f":3}],"foyer":[["^<b>Manor Foyer</b>","\n","^The foyer to the manor. From the butler's post by the front door, you can see a narrow slice of the parlour in which all you can make out is the maid, standing next to a tray of drinks and doing her level best to fade into the wallpaper.","\n","ev",{"CNT?":".^.^"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^For what seems an interminable time, you stand awkwardly in the foyer, watching the maid fidget. You strain to hear anything, but you can only catch a low murmur without moving into full view of the parlour. Then the butler returns.","\n","^\"Thank you for waiting...Lady Rose will see you now.\"","\n",{"->":".^.^.^.10"},null]}],"nop","\n","ev",{"^->":"ball.foyer"},"/ev",{"VAR=":"from","re":true},["ev",{"^->":"ball.foyer.0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"CNT?":".^.^.^"},1,"!=","/ev",{"*":".^.^.c-0","flg":3},{"s":["^Talk to Mr. Jones (the butler). ",{"->":"$r","var":true},null]}],"ev","str","^Ballroom","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["ev",{"^->":"ball.foyer.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],{"->":"ball.butler"},"\n",{"#f":5}],"c-1":["^ ",{"->":"ball.ballroom"},"\n",{"#f":5}]}],{"#f":3}],"butler":[["^(Talking to Mr. Jones, the butler)","\n","ev",{"VAR?":"from"},{"^->":"ball.butler"},"!=","/ev",[{"->":".^.b","c":true},{"b":["\n","^Mr. Jones looks imperiously down his nose at you in that way all butlers have of making you feel no taller than an insect.","\n",{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"^->":"ball.butler"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about what happened","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about what he heard","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^\"What do you remember about this evening?\" you ask him. He stares down at you haughtily for a long moment before responding.","\n","^\"I never left my post here, so I couldn't see what occurred in the parlour, except that Sarah stood right there,\" he indicates the spot where Sarah stands next to the drinks, \"except for a short period when I'm not sure where she went.\"","\n","ev",true,"/ev",{"VAR=":"left_position","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"Could you hear anything of note?\" you ask him hopefully. He seems to grow even taller and more imposing.","\n","^\"It is <i>not</i> the business of a butler to listen at doorways,\" he thunders.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["^ ",{"->":"ball.foyer"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},{"#f":5}]}],{"#f":3}],"ballroom":[["^<b>Ballroom</b>","\n","^Lady Rose's ballroom, decked out in splendor for the Chrysanthemum Ball. In one corner a young woman sits at the piano, while in another Lady Rose reclines dramatically on a divan, telling her woes to the maid standing awkwardly by the drinks tray and looking as though she would prefer to be swallowed up by the floor. On the other side of the room, four people are sitting around the fireplace.","\n","ev",{"CNT?":".^.^"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^When you enter, Lady Rose turns her tearstained face towards you.","\n","^\"My <i>dear</i>! Finally someone I can trust to help me!\" she cries, putting out her hand. You go over to her and take it, wondering what on earth could have happened.","\n",{"->":".^.^.^.10"},null]}],"nop","\n","ev",{"^->":"ball.ballroom"},"/ev",{"VAR=":"from","re":true},"ev","str","^Talk to Lady Rose","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Talk to Alice (the pianist)","/str",{"CNT?":"ball.rose.0.c-4"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Talk to Sarah (the maid)","/str",{"CNT?":"ball.rose.0.c-4"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^Foyer","/str",{"CNT?":".^.^"},1,"!=","/ev",{"*":".^.c-3","flg":5},"ev","str","^Guests (at the Fireplace)","/str",{"CNT?":"ball.rose.0.c-4"},"/ev",{"*":".^.c-4","flg":5},"ev","str","^Bust","/str",{"CNT?":"ball.rose.0.c-2"},"/ev",{"*":".^.c-5","flg":5},"ev","str","^Reflect on your progress","/str",{"CNT?":"ball.rose.0.c-0"},"/ev",{"*":".^.c-6","flg":5},{"c-0":["^ ",{"->":"ball.rose"},"\n",{"#f":5}],"c-1":["^ ",{"->":"ball.pianist"},"\n",{"#f":5}],"c-2":["^ ",{"->":"ball.maid"},"\n",{"#f":5}],"c-3":["^ ",{"->":"ball.foyer"},"\n",{"#f":5}],"c-4":["^ ",{"->":"ball.fireplace"},"\n",{"#f":5}],"c-5":["^ ",{"->":"ball.bust"},"\n",{"#f":5}],"c-6":["^ ",{"->":"ball.reflect"},"\n",{"#f":5}]}],{"#f":3}],"reflect":[["^(Reflecting on your progress)","\n",["ev",{"VAR?":"puzzle_solved"},"/ev",{"->":".^.b","c":true},{"b":["\n","^You've figured out the order of the dances and who sat out which.","\n",["ev",{"CNT?":"ball.bust.0.c-1"},"/ev",{"->":".^.b","c":true},{"b":["\n","^You've also determined that the neckace was stolen during the ","ev",{"VAR?":"soln_time"},{"f()":"numbered"},"out","/ev","^ dance. With that, you should have enough information to accuse someone.","\n",{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["\n","^Now you just need to figure out what <i>time</i> the necklace was stolen. You should check the bust again for clues.","\n",{"->":".^.^.^.5"},null]}],"nop","\n",{"->":".^.^.^.6"},null]}],["ev",{"f()":"all_clues"},"/ev",{"->":".^.b","c":true},{"b":["\n","^At this point, you think you've learned all you're going to from conversation. You need to sit down with your notes and mull this over. When you think you've figured out the order of the dances and who sat out which dance, click the \"I solved it!\" button on the right side of the page.","\n",{"->":".^.^.^.6"},null]}],["ev",{"f()":"any_clue"},"/ev",{"->":".^.b","c":true},{"b":["\n","^You've learned some crucial information, but you still don't think you have enough to solve the mystery. When you think you've figured out the order of the dances and who sat out which dance, click the \"I solved it!\" button on the right side of the page.","\n",{"->":".^.^.^.6"},null]}],[{"->":".^.b"},{"b":["\n","^You aren't sure you've learned <i>anything</i> useful yet. You should talk to everyone some more. When you think you've figured out the order of the dances and who sat out which dance, click the \"I solved it!\" button on the right side of the page.","\n",{"->":".^.^.^.6"},null]}],"nop","\n","ev","str","^Back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"ball.ballroom"},"\n",{"#f":5}]}],{"#f":1}],"rose":[["^(Talking to Lady Rose)","\n","ev",{"^->":"ball.rose"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about what happened","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Ask when the necklace was noticed missing","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Ask where the necklace was last seen","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^Ask about the dance order","/str",{"CNT?":".^.c-1"},"/ev",{"*":".^.c-3","flg":5},"ev","str","^Ask about the other guests","/str",{"CNT?":".^.c-1"},"/ev",{"*":".^.c-4","flg":5},"ev","str","^Back","/str",{"CNT?":".^.c-4"},"/ev",{"*":".^.c-5","flg":5},{"c-0":["\n","^\"What happened, Lady Rose?\" you ask.","\n","^\"It's the <i>most awful</i> thing!\" she cries, \"My precious necklace has been stolen! You have to find it!\"","\n",{"->":".^.^.^"},{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"When did you notice the necklace was missing?\" you ask.","\n","^\"It was when I went to sit out for a dance!\" Lady Rose exclaims, \"At <b>7</b>, we decided to do a few informal dances before officially starting the ball, you see, and we were an uneven number, so someone was obliged to sit out for each dance - that's about 10 minutes. Naturally as the hostess I volunteered to be first to sit out (she bats her eyelashes), but everyone <i>insisted</i> I should be the last to do so. And when I came off the floor the necklace was missing!\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^\"Where was the necklace?\" you ask, \"could it have fallen off while you were wearing it?\"","\n","^\"Good heavens, of course not!\" Lady Rose cries, \"I could never be so careless with my prized possession. No, the gemstones are <i>so heavy</i> and I decided I would wait to don it until officially starting the ball - which now I suppose won't happen after all. The necklace was of course on my mother's bust, over there, as it <i>always</i> is before the ball.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^\"Which dance did everyone sit out for?\" you ask.","\n","^\"Which dance people sat out for? All I know is that I had the chance to dance with everyone. As to who sat out when, I certainly wasn't tracking their movements. As to which dances were played, well, you would have to ask Alice about that. It is the duty of the pianist, after all, to arrange the dance in a satisfactory manner.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-4":["\n","^\"Who else was here?\" you ask.","\n","^\"Who else? Well, 4 guests had shown up when the dancing started. <b>Lady Eleanor</b>, obviously, my <i>dear</i> sister, her companion <b>Miss Baker</b>, who I'm sure you must remember, that stuffy old fool <b>Lord George</b>, of course, and that dashing new young man, <b>Mr. Parker</b>. They are all sitting over there by the fireplace. Then of course there was Mr. Jones, the butler, Alice at the piano, and Sarah by the drinks. Why, do you suspect one of my guests of taking my necklace?\" Her eyes widen in almost comical disbelief.","\n",{"->":"ball.other_guests"},{"->":".^.^.g-0"},{"#f":5}],"c-5":["^ ",{"->":"ball.ballroom"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},{"#f":5}]}],{"#f":3}],"other_guests":[["ev",{"^->":"ball.other_guests"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about <b>Lady Eleanor</b>","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about <b>Miss Baker</b>","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Ask about <b>Lord George</b>","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Ask about <b>Mr. Parker</b>","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Back","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n","^\"What do you think of Lady Eleanor?\" you ask.","\n","^\"Ugh, as you well know my haughty sister has been after my necklace for simply ages, ever since dear Mother gave it to me as a wedding present. And really, she may be the older sister, but I did marry first, while she is still single. What would she even do with such a necklace with no children to leave it to?\" You refrain from pointing out that Lady Rose herself has no children.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"What do you think of Miss Baker?\" you ask.","\n","^\"Miss Baker is a nice enough young woman I suppose, though she is of a rather mousy disposition. Earlier there was a small mishap with her dress and I thought she might have fainted from embarrassment.\"","\n","ev",true,"/ev",{"VAR=":"dress","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^\"What do you think of Lord George?\" you ask.","\n","^\"Oh, well, Lord George is a dear really, though a terrible bore at dinner time conversation. When you get him on the subject of his stocks, there is no stopping him, as I'm sure you remember.\"","\n","ev",true,"/ev",{"VAR=":"stocks","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^\"What do you think of Mr. Parker?\" you ask.","\n","^\"Mr. Parker? Oh, he is such a polite and dashing young man! When we danced the quickstep I felt quite ten years younger! It did put me rather out of breath of course.","\n","ev",true,"/ev",{"VAR=":"clue_4_1","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-4":["^ ",{"->":"ball.rose"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},"ev","str","^Back","/str","/ev",{"*":".^.c-5","flg":4},{"c-5":["^ ",{"->":"ball.rose"},"\n",{"#f":5}],"#f":5}]}],{"#f":3}],"pianist":[["^(Talking to the pianist, Alice)","\n","ev",{"VAR?":"from"},{"^->":"ball.pianist"},"!=","/ev",[{"->":".^.b","c":true},{"b":["\n","^Alice seems fully absorbed in looking through some music on the piano. You have to clear your throat a few times to get her attention, and when she does turn toward you, she still has a faraway look in her eyes.","\n",{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"^->":"ball.pianist"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about what happened","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about the music","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^\"What do you remember about the evening?\" you ask her.","\n","^\"What do I remember...\" she muses. \"Well...I was playing...I was just starting a piece...and there was an interruption...a terrible screaming about something or other...then my music was snatched away!\" <i>That</i> she finds clearly distressing, after mentioning \"terrible screaming\" with no more than mild annoyance.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"Do you remember what dances you played?\" you ask.","\n","^\"What dances?\" She seems to consider that, running her hands up and down the piano keys lovingly, \"I know we played...a <b>Tango</b>, a <b>Quickstep</b>...a <b>Waltz</b>...and a <b>Foxtrot</b>...I couldn't tell you the order of the pieces...when I play I lose myself in the music...and have no sense of time passing...or the dance changing...But I <i>can</i> tell you that when Lady Rose snatched the last score,\" she looks up at you, suddenly intense, \"she was screaming that she couldn't bear to hear music anymore as her necklace was missing. I saw that the melody underneath was a tango before Lady Rose swept it along with the rest of the music to the floor, putting everything hopelessly out of order!\" Alice finishes, clearly affronted.","\n","ev",true,"/ev",{"VAR=":"clue_2","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-2":["^ ","\n",{"->":"ball.ballroom"},{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},{"#f":5}]}],{"#f":3}],"maid":[["^(Talking to the maid, Sarah)","\n","ev",{"VAR?":"from"},{"^->":"ball.maid"},"!=","/ev",[{"->":".^.b","c":true},{"b":["\n","^Sarah jumps when you come up to her, almost knocking over the tray of drinks.","\n",{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"^->":"ball.maid"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about what happened","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about the dance order","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Ask about when she left her position","/str",{"CNT?":".^.c-0"},{"VAR?":"left_position"},"&&",{"VAR?":"repair"},"!","&&","/ev",{"*":".^.c-2","flg":5},"ev","str","^Ask about the dress repair","/str",{"CNT?":".^.c-0"},{"VAR?":"repair"},"&&","/ev",{"*":".^.c-3","flg":5},"ev","str","^Back","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n","^\"What do you remember about the evening?\" you ask her. She swallows nervously.","\n","^\"W-well, I was standing here in case anyone would need a drink, and the ladies and gentlemen were dancing. I didn't leave this spot except for one dance.\"","\n","ev",true,"/ev",{"VAR=":"left_position","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"What do you remember about the dance order?\" you prompt.","\n","^\"The dancing?\" she looks confused. \"I really can't say. I can't tell the difference between the dances, and I didn't notice which guest was sitting out.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^\"What happened when you left your position?\" you ask.","\n","^\"Oh - that was when Miss Baker had torn her dress, and I went with her to repair it. But we were only away for part of one dance.\"","\n","ev",true,"/ev",{"VAR=":"dress","re":true},"ev",true,"/ev",{"VAR=":"repair","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^\"What happened with Miss Baker's dress?\" you ask.","\n","^Oh - that was when I left my position. She had torn her dress, and I went with her to repair it. But we were only away for part of one dance.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-4":["^ ",{"->":"ball.ballroom"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},{"#f":5}]}],{"#f":3}],"bust":[["^(The bust of Lady Rose and Lady Eleanor's mother)","\n","^Lady Charlotte, preserved in immortal middle age by granite as hard as her indominitable will, glares imperiously down at you. You imagine her expression is reproachful, as though blaming you for the loss of the necklace that formerly graced her neck. ","ev",{"CNT?":"solved"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You should focus on figuring out who sat out when before looking for clues here.",{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"^->":"ball.bust"},"/ev",{"VAR=":"from","re":true},"ev","str","^Look for clues","/str",{"CNT?":"solved"},"/ev",{"*":".^.c-0","flg":21},"ev","str","^Check clock","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Back","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^Looking at the bust again, you notice the small clock sitting next to it and realize that you have not heard it ticking.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^Examining the small clock, you realize that its screen has been damaged, and the time is frozen at ","ev",{"f()":"realtime"},"out","/ev","^ - in the middle of the ","ev",{"VAR?":"soln_time"},{"f()":"numbered"},"out","/ev","^ dance - the ","ev",{"VAR?":"soln_dance"},"out","/ev","^!","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["^ ",{"->":"ball.ballroom"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},{"#f":5}]}],{"#f":3}],"fireplace":[["^<b>Ballroom (Fireplace)</b>","\n","^The four guests sit awkwardly around the marble fireplace, looking as if they would rather be anywhere else.","\n","ev",{"^->":"ball.fireplace"},"/ev",{"VAR=":"from","re":true},"ev","str","^Talk to Lady Eleanor","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Talk to Miss. Baker","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Talk to Lord George","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Talk to Mr. Parker","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Back","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["^ ",{"->":"ball.eleanor"},"\n",{"#f":5}],"c-1":["^ ",{"->":"ball.baker"},"\n",{"#f":5}],"c-2":["^ ",{"->":"ball.george"},"\n",{"#f":5}],"c-3":["^ ",{"->":"ball.parker"},"\n",{"#f":5}],"c-4":["^ ",{"->":"ball.ballroom"},"\n",{"#f":5}]}],{"#f":3}],"eleanor":[["ev",{"VAR?":"from"},{"^->":"ball.eleanor"},"!=","/ev",[{"->":".^.b","c":true},{"b":["\n","^Lady Eleanor regards you haughtily. \"I don't know why you feel the need to question <i>me</i>,\" she sniffs, \"I couldn't possibly have anything to do with such an ignoble crime as the theft of my <i>dear</i> sister's necklace.\"","\n",{"->":".^.^.^.6"},null]}],"nop","\n","^(Talking to Lady Eleanor)","\n","ev",{"^->":"ball.eleanor"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about what happened","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about Miss Baker","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Ask about Mr. Parker","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^Ask about Lord George","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-3","flg":5},"ev","str","^Accuse","/str",{"CNT?":"ball.bust.0.c-1"},"/ev",{"*":".^.c-4","flg":21},"ev","str","^Back","/str","/ev",{"*":".^.c-5","flg":4},{"c-0":["\n","^\"What can you tell me about what happened?\" you ask.","\n","^\"What happened? Well, we had decided to do some dancing as the four of us were here already, and just as the fourth dance was concluding, my sister started screaming her head off about her necklace being stolen! It was a most indecorous display, especially as by all rights, that necklace <i>should</i> be mine, as the eldest daughter. I don't see what Rose being married first has to do with anything.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"What do you think of Miss Baker?\" you ask. At that, Lady Eleanor's eyes flash indignantly.","\n","^\"I simply don’t see why I should have been obliged to sit out for a dance, when isn’t the function of one’s companion to preserve them from such indignities? Terribly presumptuous of the girl to swan boldly onto the dance floor like a person of consequence, when she wouldn’t have a scrap to her name without my generous patronage. And what uncultured dancing! It’s not surprising at all that she stepped on her own dress during her ungracious attempt at a waltz, and what an unbecoming shade of red she became! If I had so embarrassed myself in front of my betters, I would not have had the nerve to show myself again. Unfortunately, she returned as soon as she had gotten Lady Rose’s maid to repair her wardrobe, only missing the next dance - disregarding the inconvenience to the rest of the party of not having a maid to attend our needs, I might add.\"","\n","ev",true,"/ev",{"VAR=":"dress","re":true},"ev",true,"/ev",{"VAR=":"repair","re":true},"ev",true,"/ev",{"VAR=":"clue_1","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^\"What do you think of Mr. Parker?\" you ask.","\n","^“Mr. Parker? That young man knows how to pay respect to his betters. A little too well, I think sometimes.\" Lady Eleanor lowers her voice before continuing in a conspiratorial tone. \"Why, Rose was positively swooning for him earlier, and I simply don’t think it’s appropriate for a woman of her age to be dancing the tango with a man quite twenty years her junior.”","\n","ev",true,"/ev",{"VAR=":"clue_4_2","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^\"What do you think of Lord George?\" you ask. She rolls her eyes.","\n","^\"Lord George is a puffed up old bore, as you well know. At the last gathering I attended with him, I was forced to listen to him ramble about stocks for over half an hour before I was able to turn him over to Miss Baker. He's been more quiet than usual tonight, though.\"","\n","ev",true,"/ev",{"VAR=":"stocks","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-4":["\n","^\"<i>You</i> stole the necklace for yourself!\" you accuse Lady Eleanor.","\n",["ev",{"VAR?":"soln_time"},4,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"accuse"},{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["\n","^\"Me? I've never been so insulted in my life!\" Her affront seems so genuine that you second guess yourself. Could Lady Eleanor really have been the thief?\"","\n",{"->":".^.^.^.5"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-5":["^ ",{"->":"ball.fireplace"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},{"#f":5}]}],{"#f":3}],"baker":[["ev",{"VAR?":"from"},{"^->":"ball.baker"},"!=","/ev",[{"->":".^.b","c":true},{"b":["\n","^Miss Baker pales at your approach. \"Of course, I'd be happy to help in any way I can,\" she mumbles.","\n",{"->":".^.^.^.6"},null]}],"nop","\n","^(Talking to Miss. Baker)","\n","ev",{"^->":"ball.baker"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about what happened","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about Lady Eleanor","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Ask about Mr. Parker","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^Ask about Lord George","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-3","flg":5},"ev","str","^Ask about her dress","/str",{"CNT?":".^.c-0"},{"VAR?":"dress"},"&&","/ev",{"*":".^.c-4","flg":5},"ev","str","^Accuse","/str",{"CNT?":"ball.bust.0.c-1"},"/ev",{"*":".^.c-5","flg":21},"ev","str","^Back","/str","/ev",{"*":".^.c-6","flg":4},{"c-0":["\n","^\"What can you tell me about what happened?\" you ask. She swallows nervously.","\n","^\"I can't tell you anything - we were dancing, and then Lady Rose started crying that her necklace was missing. I don't know how that could have happened. I wasn't paying any attention to it when I was dancing, and when I wasn't dancing, I was more focused on my dress.\"","\n","ev",true,"/ev",{"VAR=":"dress","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"What do you think about Lady Eleanor?\" you ask. She pales.","\n","^\"I'm grateful to her, of course. She may not always be the most, ah, friendly, but she provides for me adequately.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^\"What do you think about Mr. Parker?\" you ask. She blushes and looks down.","\n","^\"Mr. Parker? I think he must be from a grand family. He's so gentlemanly. I would dance with him all night if I could,\" she says dreamily.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^\"What do you think about Lord George?\" you ask.","\n","^\"Um, Lord George is a true gentleman, of course. He's always so <i>generously</i> trying to teach me about stocks.","\n","ev",true,"/ev",{"VAR=":"stocks","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-4":["\n","^\"What happened to your dress?\" you ask. She flushes scarlet.","\n","^\"I don't know <i>what</i> happened. One minute I was dancing, and the next I was sprawled on the floor, and my dress was ripped. It was the <i>most humiliating</i> experience <i>of my life</i>. Luckily Sarah was able to fix it in no time, and I was only gone for half the next dance.\"","\n","ev",true,"/ev",{"VAR=":"repair","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-5":["\n","^\"<i>You</i> stole the necklace for Lady Eleanor!\" you accuse Miss Baker.","\n",["ev",{"VAR?":"soln_time"},3,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"accuse"},{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["\n","^\"Me? I <i>swear</i> I had nothing to do with it!\" Her affront seems so genuine that you second guess yourself. Could Miss Baker really have been the thief?\"","\n",{"->":".^.^.^.5"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-6":["^ ",{"->":"ball.fireplace"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},{"#f":5}]}],{"#f":3}],"george":[["ev",{"VAR?":"from"},{"^->":"ball.george"},"!=","/ev",[{"->":".^.b","c":true},{"b":["\n","^Lord George puffs up with excitement. \"Jolly good, you're going to get to the bottom of this mystery, are you? Ask me anything you like, my memory is like a steel trap and still sharp as ever!\"","\n",{"->":".^.^.^.6"},null]}],"nop","\n","^(Talking to Lord George)","\n","ev",{"^->":"ball.george"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about what happened","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about Miss Baker","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Ask about Lady Eleanor","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^Ask about Mr. Parker","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-3","flg":5},"ev","str","^Ask about his stocks","/str",{"CNT?":".^.c-0"},{"VAR?":"stocks"},"&&","/ev",{"*":".^.c-4","flg":5},"ev","str","^Accuse","/str",{"CNT?":"ball.bust.0.c-1"},"/ev",{"*":".^.c-5","flg":21},"ev","str","^Back","/str","/ev",{"*":".^.c-6","flg":4},{"c-0":["\n","^\"What can you tell me about what happened?\" you ask.","\n","^\"Well, we were having some dancing before the ball was to start - jolly strange idea in my opinion. I'm not as spry as I used to be, you know, and I'd prefer to save my energy for the main event. That was all stopped though, when at the end of the fourth dance, Lady Rose started having the vapours over some necklace or other that's missing. I daresay she only misplaced it, and it'll turn up soon enough on its own without all this hullabaloo.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"What do you think about Miss Baker?\" you ask.","\n","^\"Charming young woman. Bit mousy. Needs more gumption in my opinion. Lets Lady Eleanor walk all over her with that high and mighty attitude.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^\"What do you think about Lady Eleanor?\" you ask.","\n","^\"Believe it or not, she was a stunner in her youth. Still is, if you can ignore that pinched expression she wears. Makes her companion's life miserable, though.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^\"What do you think about Mr. Parker?\" you ask.","\n","^\"Smarmy young fellow. He supposedly comes from some old family in Europe, but I don't know anyone who has met a single one of his connections. He just appeared in town recently acting as if he owned the place. I don't know how he's taken in Lady Rose, who generally I consider to be a sensible woman.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-4":["\n","^\"How are your stocks doing?\" you ask. He looks around wildly.","\n","^\"Oh, erm, they're doing as well as ever! But I'm sure you don't want to hear about something so dull. And they certainly have nothing to do with this mystery.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-5":["\n","^\"<i>You</i> stole the necklace!\" you accuse Lord George.","\n",["ev",{"VAR?":"soln_time"},2,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"accuse"},{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["\n","^\"Me? I've never been so insulted in my life!\" His affront seems so genuine that you second guess yourself. Could Lord George really have been the thief?\"","\n",{"->":".^.^.^.5"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-6":["^ ",{"->":"ball.fireplace"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},{"#f":5}]}],{"#f":3}],"parker":[["ev",{"VAR?":"from"},{"^->":"ball.parker"},"!=","/ev",[{"->":".^.b","c":true},{"b":["\n","^Mr. Parker barely reacts to your approach. \"Sure,\" he drawls, \"I'll answer whatever you want. But I doubt it'll be of any use.\"","\n",{"->":".^.^.^.6"},null]}],"nop","\n","^(Talking to Mr. Parker)","\n","ev",{"^->":"ball.parker"},"/ev",{"VAR=":"from","re":true},"ev","str","^Ask about what happened","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask about Miss Baker","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Ask about Lady Eleanor","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^Ask about Lord George","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-3","flg":5},"ev","str","^Accuse","/str",{"CNT?":"ball.bust.0.c-1"},"/ev",{"*":".^.c-4","flg":21},"ev","str","^Back","/str","/ev",{"*":".^.c-5","flg":4},{"c-0":["\n","^\"What can you tell me about what happened?\" you ask.","\n","^\"<i>Ob-vi-ous-ly</i>, Lady Rose's precious necklace has been misplaced, and now the party is over. Not that it was much of a party to begin with, with three stuffed old birds and one skittish little mouse for company, but at least the music was good.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^\"What do you think about Miss Baker?\" you ask.","\n","^\"A skittish little mouse. Though I did admire her spirit in ignoring Lady Eleanor's waspish looks when Lady Eleanor was asked to sit out for a dance. I'm sure she'll pay for that later.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^\"What do you think about Lady Eleanor?\" you ask.","\n","^\"Unpleasant woman. Acts like she's the Queen of England. Expects everyone to bow to her every whim, especially her companion.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^\"What do you think about Lord George?\" you ask.","\n","^\"Insufferably boring old fool. I remember that when he heard a quickstep was planned, he decided to sit out the dance before to prepare himself…after all, he isn’t a young fellow anymore, you know. <i>I</i> don’t need any preparation to dance the quickstep; I could dance for hours without sitting, though I did of course sit out one dance to be polite. I had a private laugh about that when Lady Rose requested that the quickstep be delayed by a dance. I say, when Lord George realized that there was a dance between his break and the quickstep, he was quite irate. The old chap needn’t have worried though, as Lady Rose is none too spry either, and the quickstep was played almost sedately in my opinion. Hardly deserving of the name.\"","\n","ev",true,"/ev",{"VAR=":"clue_3","re":true},{"->":".^.^.g-0"},{"#f":5}],"c-4":["\n","^\"<i>You</i> stole the necklace!\" you accuse Mr. Parker.","\n",["ev",{"VAR?":"soln_time"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"accuse"},{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["\n","^\"Me? I realize it's easy to accuse someone new to town, but I assure you, I had nothing to do with this theft!\" His affront seems so genuine that you second guess yourself. Could Mr. Parker really have been the thief?\"","\n",{"->":".^.^.^.5"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-5":["^ ",{"->":"ball.fireplace"},"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^"},"^THE END","\n","end",{"#f":5}]}],{"#f":3}],"#f":3}],"global decl":["ev",false,{"VAR=":"stocks"},false,{"VAR=":"dress"},false,{"VAR=":"repair"},false,{"VAR=":"left_position"},{"^->":"ball"},{"VAR=":"from"},false,{"VAR=":"clue_1"},false,{"VAR=":"clue_2"},false,{"VAR=":"clue_3"},false,{"VAR=":"clue_4_1"},false,{"VAR=":"clue_4_2"},false,{"VAR=":"puzzle_solved"},"str","^","/str",{"VAR=":"soln_suspect"},"str","^","/str",{"VAR=":"soln_dance"},"str","^","/str",{"VAR=":"soln_time"},"/ev","end",null],"#f":1}],"listDefs":{}}