{"inkVersion":21,"root":[[{"->":"train"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"train":["^<h1><i>The Wild Rose Train</i></h1>","\n","^Your 3-month long expedition to the city of Watertown has finally paid off, your research has led to a new medicinal herb that is bound to lead to academic and financial success. All you need to do is travel back to Riverside, to deliver the news to your PhD advisor. With your discovery tucked safely in your briefcase, you take a late night journey on the Wild Rose Train. After a well-deserved night of rest, you wake up to find your briefcase, along with your groundbreaking discoveries, missing!","\n",{"->":".^.sleeping_car"},{"sleeping_car":["ev",{"VAR?":"SLEEPING_CAR"},"/ev",{"VAR=":"location","re":true},"^<b><i>Sleeping Car</i></b>","\n","^Your sleeping car. You've ransacked it ","ev",{"CNT?":".^"},2,"+","out","/ev","^ times looking for your briefcase, but it isn't here.","\n","ev",{"^->":"train.sleeping_car"},"/ev","thread",{"->":".^.^.exits"},{"#f":3}],"engine":[["ev",{"VAR?":"ENGINE"},"/ev",{"VAR=":"location","re":true},"^<b><i>Engine</i></b>","\n","^The engine of the train. The conductor is here.","\n","ev","str","^Talk to the conductor","/str",{"CNT?":"train.discovery"},"!","/ev",{"*":".^.c-0","flg":5},"ev","str","^Talk to the conductor","/str",{"CNT?":"train.discovery"},"/ev",{"*":".^.c-1","flg":5},{"c-0":["^ ",{"->":"train.conductor1"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.conductor2"},"\n","ev",{"^->":"train.engine"},"/ev","thread",{"->":"train.exits"},{"#f":5}]}],{"#f":3}],"conductor1":[["^(Talking to the conductor, Jim Gallagher)","\n","ev","str","^Ask about briefcase","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Ask about the other passengers","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":21},"ev","str","^Ask about stations","/str",{"CNT?":".^.c-1"},"/ev",{"*":".^.c-2","flg":21},"ev","str","^Ask about staff","/str",{"CNT?":".^.c-1"},"/ev",{"*":".^.c-3","flg":21},"ev","str","^Move to another part of the train","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["^\"Excuse me\", you say, \"I had a very important briefcase in my car, but it's missing. Has something like that been found anywhere on the train?\"","\n","^\"Hm,\" the Jim responds, \"I haven't had any reports of items found. Maybe one of the other passengers got off with it by mistake?\"","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["^\"Who else was on the train today?\" you ask.","\n","^\"Let's see, it was a quiet journey, and there were only four others besides you - <b>Sir Ethan Owen</b>, <b>Ms. Madeleine Baker</b>, <b>Mr. George Herbert</b>, and <b>Dr. Ava Finch</b>. Not surprised you didn't meet them, they each had their own room in car 1-4. But they have all left now, it's just you and us staff.\"","\n",{"->":".^.^.^"},{"#f":5}],"c-2":[{"->":"train.stations"},"\n",{"#f":5}],"c-3":["^ ",{"->":"train.staff"},"\n",{"#f":5}],"c-4":["^ ","ev",{"^->":"train.engine"},"/ev",{"->":"train.exits"},"\n",{"#f":5}]}],{"#f":1}],"staff":["^\"Who all is on board right now, besides us?\" you ask.","\n","^\"Ahh well there are two crew members here, apart from myself: May Gardner, our dedicated chief, whom you can likely locate in the dining car, and Katrina Clements our service attendant likely to be about the corridor. Might not be a bad idea to ask Katrina about your briefcase.\" he tells you.","\n",{"->":".^.^.conductor1"},{"#f":1}],"stations":["^\"Can you tell me what stations the other passengers boarded and departed?\" you ask.","\n","^\"Oh yes of course.\" Jim begins shuffling through a series of documents at his stations. After several minutes of this he furrows his brows and returns his attention to you. \"This is quite mysterious indeed. It appears your briefcase wasn't the only thing that went missing last night, but the ticket information has disappeared as well.\"","\n","^Dread fills your stomach. Two things going missing in one night. It is starting to seem as if someone doesn't want to be found. Your missing briefcase doesn't seem like a mistake at all!","\n","^\"Here is what I can tell you, \" Jim continues. \"I know everyone was on board by Watertown, that is when you got on correct?\" You nod. \"And everyone else has already departed. Which means that the passengers each got off at either <b>Greencester</b>, <b>Seastead</b>, <b>Hogfield</b>, or <b>Forest Hills </b>. I do remember we had exactly one passenger depart at each of those stations, but I am afraid I cannot tell you who departed where\"","\n",{"->":".^.^.conductor1"},{"#f":1}],"conductor2":[["^\"Let me know if there is anything I else can do to assist in retrieving this item”","\n","ev","str","^Tell me about Sir Ethan Owen","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Tell me about Ms. Madeleine Baker","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Tell me about  Mr. George Herbert","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Tell me about Dr. Ava Finch","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Did anything go wrong with the train last night?","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Move to another part of the train","/str","/ev",{"*":".^.c-5","flg":4},{"c-0":["^ ",{"->":"train.1_2"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.1_3"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.1_4"},"\n",{"#f":5}],"c-3":["^ ",{"->":"train.1_5"},"\n",{"#f":5}],"c-4":["^ ",{"->":"train.1_6"},"\n",{"#f":5}],"c-5":["^ ","ev",{"^->":"train.engine"},"/ev",{"->":"train.exits"},"\n",{"#f":5}]}],{"#f":1}],"1_2":["^“Sir Ethan Owen? Not sure there is much to be said about him. He is third in line for his father's inheritance. He uses plenty of his father’s money, I know this much. Requested the premium service at every possible turn, not that I would consider our dear old Wild Rose a premium vessel by any means.  Only so much we can do to accommodate the fellow. Talkative fellow though, unless you mention either of his brothers that is.”","\n","^He doesn't like talking about his brothers. Could there be a rivalry there? If he was trying to impress his father, showing him your discovery would certainly accomplish this!","\n",{"->":".^.^.conductor2"},{"#f":1}],"1_3":["^“Ms. Madeleine Baker? She is a interesting character isn’t she? When she handed me her ticket I couldn’t help but notice the intense floral scent to her. I had asked her what perfume she wore, but she denied wearing any”","\n",{"->":".^.^.conductor2"},{"#f":1}],"1_4":["^“Mr. George Herbert? That old banker? He is traveling here on business. Was quite agitated when I interacted with him. Apparently, he was not expecting to ride our dear old Wild Rose last evening.  I find her a joy to ride in, but apparently he desired more … luxury…. accommodations”","\n",{"->":".^.^.conductor2"},{"#f":1}],"1_5":["^\"Dr. Ava Finch? I do believe she is a professor Raven Wood University. seemed like a very intelligent women. But you probably would know more then me.\"","\n","^Hmmm Raven Wood, you have definitely have heard of this university before. In fact they are your direct rival! Could she have taken your briefcase to prevent you from publishing your findings first?","\n",{"->":".^.^.conductor2"},{"#f":1}],"1_6":[[["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^“Ahh well you know that the Wild Rose is an old train, so is bound to have some issues. While last night's journey was mostly smooth sailing, I do recall we had some issues with the car doors” ",{"->":".^.^.17"},null],"s1":["pop","^ \"Any other questions about the car doors?\"",{"->":".^.^.17"},null],"#f":5}],"\n","ev","str","^Which cars had issues?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I didn’t hear any car doors opening last night","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Do you think they were tampered with?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Ok thank you for your time","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"train.1_7"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.1_8"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.1_9"},"\n",{"#f":5}],"c-3":["^ ",{"->":"train.conductor2"},"\n",{"#f":5}]}],{"#f":1}],"1_7":["^“Working nights isn’t easy for an old fellow like me, so unfortunately I can’t recall which cars exactly had issues. Two cars back to back though. We first had issues at <b>Seastead </b>, and then the <b>very next car</b> down had an issue when we stopped at <b>Forest Hills</b>.”","\n",{"->":".^.^.1_6"},{"#f":1}],"1_8":["^“Oh, you wouldn't have. You see on these night rides we like to keep everything as quiet as possible. Therefore we only open the doors at cars where there are passengers departing at that station. Since you all were getting off at different stations, we only had to open one door at each station”","\n",{"->":".^.^.1_6"},{"#f":1}],"1_9":["^“Tampered? Well, that is an interesting idea certainly. This train does have a lot of issues due to her age, but I guess I do not recall having problems with the doors specifically. We are not a very well-staffed train, so it’s certainly possible that someone could have messed with one of the systems without our knowing. However, I do not believe I found any signs of something specifically being off. If you do find evidence of tampering, you let me know ok?”","\n",{"->":".^.^.1_6"},{"#f":1}],"dining_car":[["ev",{"VAR?":"DINING_CAR"},"/ev",{"VAR=":"location","re":true},"^<b><i>Dining Car</i></b>","\n","^In the dining car, still smells like bacon. The chief May Gardner is here.","\n","ev","str","^Talk to May Gardner","/str",{"CNT?":"train.discovery"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Move to another part of the train","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"train.2_1"},"\n",{"#f":5}],"c-1":["^ ","ev",{"^->":"train.dining_car"},"/ev",{"->":"train.exits"},"\n",{"#f":5}]}],{"#f":3}],"2_1":[[["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^“Honestly not surprised one of these passengers was a thief, there was something off about all of them you could tell. Not sure how much help I can be, spent the morning in the dining car but I will tell you what I do know.” ",{"->":".^.^.17"},null],"s1":["pop","^ \"Any other questions?\"",{"->":".^.^.17"},null],"#f":5}],"\n","ev","str","^Tell me about Sir Ethan Owen","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Tell me about Ms. Madeleine Baker","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Tell me about  Mr. George Herbert","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Tell me about Dr. Ava Finch","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^What was served for breakfast this morning?","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Move to another part of the train","/str","/ev",{"*":".^.c-5","flg":4},{"c-0":["^ ",{"->":"train.2_2"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.2_3"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.2_4"},"\n",{"#f":5}],"c-3":["^ ",{"->":"train.2_5"},"\n",{"#f":5}],"c-4":["^ ",{"->":"train.2_6"},"\n",{"#f":5}],"c-5":["^ ","ev",{"^->":"train.dining_car"},"/ev",{"->":"train.exits"},"\n",{"#f":5}]}],{"#f":1}],"2_2":["^“Sir Ethan Owen? Can’t say much about him I am afraid. Like you he was asleep all through breakfast this morning. Or maybe he left at one of the early stations, I cannot say. Heard from Katrina that he was a prick though.”","\n",{"->":".^.^.2_1"},{"#f":1}],"2_3":[["^“",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^<b>Madeleine Baker</b>? She was up bright and early this morning. Wanted to make sure got the first cup of coffee.",{"->":".^.^.17"},null],"s1":["pop","^ Do you want to ask other questions about Madeleine?",{"->":".^.^.17"},null],"#f":5}],"^”","\n","ev","str","^Did you notice anything strange about her?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^What was she doing during breakfast?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Thank you for your time","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"train.2_7"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.2_8"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.2_1"},"\n",{"#f":5}]}],{"#f":1}],"2_7":["^“Oh yes she was a very strange lady I will tell you. Her dress must have had at least 5 colors and 3 patterns. Really a sight to see, especially so early in the morning. Despite her elaborate get up she was hardly a well put together woman. Didn’t even wash her hands, I could see the dirt under her fingernails even from across the car. Can’t imagine how someone eats with hands like that.”","\n",{"->":".^.^.2_3"},{"#f":1}],"2_8":[[["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^“She was clearly lost in thought over something, kept staring out the window of the train. Oh, and sketching in the notebook of hers. Some kind of flower.” ",{"->":".^.^.17"},null],"s1":["pop","^ Do you have other questions about the sketch?",{"->":".^.^.17"},null],"#f":5}],"\n","ev","str","^Can you describe the flower?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Did she tell you anything about the sketch?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Did you see what she was looking at?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^About Madeleine...","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"train.2_9"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.2_10"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.2_11"},"\n",{"#f":5}],"c-3":["^ ",{"->":"train.2_3"},"\n",{"#f":5}]}],{"#f":1}],"2_9":["^”It was a mysterious-looking thing with strange spindly petals. I am not much of a botanist myself, but I have never seen anything of the sort before. “","\n","^Her description doesn't describe your plant at all. You can't recall a plant that matches this description exactly.","\n",{"->":".^.^.2_8"},{"#f":1}],"2_10":["^“I did ask what kind of plant that was, and she told me it didn’t exist …. yet. Apparently she had this vision of a flower that would be a cross of a Lily only found in <b>Forest Hills</b> with one of her personal breeds. Went on this train to find it. Personally, I think nature has provided us with more than enough flowers without all this fiddling.”","\n",{"->":".^.^.2_9"},{"#f":1}],"2_11":["^“Couldn’t tell you. The train was going so fast, not sure she could be seeing anything at all”","\n",{"->":".^.^.2_8"},{"#f":1}],"2_4":["^\"Mr George Herbert? Not much of a talker that man is. Asked me to Irish his coffee this morning, if you know what I mean.\"","\n",{"->":".^.^.2_1"},{"#f":1}],"2_5":["^\"Dr. Finch? I am surprised you don't know of her already. Hearing her speak it sounds like she is the top researcher in her field.\"","\n","^\"What area of research is she in?\" you ask. You always are curious to hear about other people's research.","\n","^\"Oh I wouldn't know. She kept talking in codes. Something about  pistils and xylems, whatever that could mean.\" May responds.","\n","^Luckily you know what she was talking about, pistils and xylems are both parts of plants. So it's likely she is working in your same field, or at least an adjacent one. But she certainly wouldn't be a top researcher like she said. Everyone knows that the top botany research is done at Riverside University! And you know for sure that she is not a professor there.","\n",{"->":".^.^.2_1"},{"#f":1}],"2_6":[["^\"Well as you may know the Wild Rose is known for it's dining. We had a wide array of options for our guests: pancakes, muffins, bacon, and french toast. Oh and of course, our specialty lemon strawberry crepes!\"","\n","^A growl from your stomach reminds you that you slept through breakfast this morning.","\n","ev","str","^Any chance that there is some leftover?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^thank you for your time","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"train.2_12"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.2_1"},"\n",{"#f":5}]}],{"#f":1}],"2_12":["^\"Well you should know it's against policy to serve breakfast outside of official hours... but with the morning you had I can maybe make an exception\"","\n",{"->":".^.^.2_1"},{"#f":1}],"corridor":[["ev",{"VAR?":"CORRIDOR"},"/ev",{"VAR=":"location","re":true},"^<b><i>Corridor</i></b>","\n",["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^The corridor that connects the sleeping cars to the dining car. The service attendant is here.",{"->":".^.^.17"},null],"s1":["pop",{"->":".^.^.17"},null],"#f":5}],"\n","ev","str","^Ask about briefcase","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Wait for Katrina to return","/str",{"CNT?":".^.c-0"},{"CNT?":"train.conductor1.0.c-0"},"&&","/ev",{"*":".^.c-1","flg":21},"ev","str","^Talk to Katrina","/str",{"CNT?":"train.discovery"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^Search the corridor","/str",{"CNT?":"train.discovery"},"/ev",{"*":".^.c-3","flg":5},"ev","str","^Move to another part of the train","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["^ \"Hello miss, I am missing a very important item. Could you help me find it?\" you ask. ","\n","^\"Oh well that is quite unfortunate isn't it?\" the service attendant responds. \"I am Katrina, I will help you in anyway I can. Can I ask what you are looking for?\"","\n","^\"A briefcase, it contains very important research so I need it back as soon as possible.\"","\n","^\"I understand, I would be distraught if I lost luggage. And the most important thing I carry is my pen collect! If you will allow me, I will search the rooms to see if it is still on board. If you haven't already, why don't you talk with our conductor as well, he should be in the engine.\" she tells you. She briskly exits the corridor, her large set of keys clicking behind her.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["^ ",{"->":"train.discovery"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.3_1"},"\n",{"#f":5}],"c-3":["^ ",{"->":"train.search"},"\n",{"#f":5}],"c-4":["^ ","ev",{"^->":"train.corridor"},"/ev",{"->":"train.exits"},"\n",{"#f":5}]}],{"#f":3}],"discovery":[["ev",{"VAR?":"NO_WHERE"},"/ev",{"VAR=":"location","re":true},"^Anxiously you stand in the corridor hoping that Katernina locate your briefcase quickly. After several agonizing minutes, you see a distraught Katrina return.","\n","^\"Oh you must believe me, I searched everywhere! But nothing... nada... zlitch. Somehow your briefcase must have got off the train sometime last night.\"","\n","^And you know exactly how. Your briefcase was safely on your desk when you went to sleep last night. The only way the briefcase is no longer on the train, is if one of the other passengers came into your room at took it! You must find out which passenger took it and where they departed before it's too late!","\n","^Unfortunately, you don't know where each passenger departed or even what car they stayed in last night. If you can figure out what station each passenger departed and and what room they stayed in, you will be one step closer to your briefcase. You should talk more with the staff and see if you can gather anymore clues from them!","\n","ev","str","^Move to another part of the train","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ","ev",{"^->":"train.corridor"},"/ev",{"->":"train.exits"},"\n",{"#f":5}]}],{"#f":1}],"search":[["^Search the corridor.","\n","ev","str","^left","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^right","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^search the mailbox","/str",{"CNT?":".^.c-1"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^up","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^I am done searching","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["^ The left side of the corridor seems has a small end table with a bowl full of mints. You take one from the bowl for good measure. ","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["^ The right side of the corridor contains a small mailbox where passengers can drop off letter they would like to be sent out. Katrina seems to be distracted by cleaning right now, you could probably take a peak inside. ","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["^ ",{"->":"train.letter"},"\n",{"#f":5}],"c-3":["^ The lights on this train seem quite old. They keep flickering, which certainly isn't helping your bad mood. ","\n",{"->":".^.^.^"},{"#f":5}],"c-4":["^ ",{"->":"train.corridor"},"\n",{"#f":5}]}],{"#f":1}],"letter":[["^Carefully peaking inside the mailbox, you can see one letter sent from Mr. George Herbert.","\n","ev","str","^Read Letter","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ","\n","^“Dear Ms. Penelope Steward,","\n","^It appears that I will be stuck in transit for an additional night than expected. The train you had booked for me was canceled last night due to a disturbance on the track. The next train out wasn’t until the next day with only economy cars remaining. You well know how hard travel is on me, and even more so in these conditions. While I cannot technically place blame on you for these circumstances, I do hope you take responsibility. I expect my estate to be well taken care of upon my return. Additionally, I feel as if Mr James Fester would be justified in feeling slighted by the delay in our meeting. Please arrange for the finest bottle of whiskey to be sent to his estate in <b>Hogfield</b>. I would arrange it myself but am much too weary.","\n","^Sincerely, <b>George Herbert</b>”","\n",{"->":"train.search"},{"#f":5}]}],{"#f":1}],"3_1":[["^\"I would be happy to help you in anyway that I can!\"","\n","ev","str","^Tell me about Sir Ethan Owen","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Tell me about Ms. Madeleine Baker","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Tell me about  Mr. George Herbert","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Tell me about Dr. Ava Finch","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Did you find anything else on the train?","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Go back to the corridor","/str","/ev",{"*":".^.c-5","flg":4},{"c-0":["^ ",{"->":"train.3_2"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.3_3"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.3_4"},"\n",{"#f":5}],"c-3":["^ ",{"->":"train.3_5"},"\n",{"#f":5}],"c-4":["^ ",{"->":"train.3_6"},"\n",{"#f":5}],"c-5":["^ ",{"->":"train.corridor"},"\n",{"#f":5}]}],{"#f":1}],"3_2":[[["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^\"Oh that man is infuriating! We made a complaint to me early this morning about the noise from another car.  I had to inform this was in fact a public train, and he would have to deal with some noise from the other passenger. I don't really believe he had heard much at all anyway.\" ",{"->":".^.^.17"},null],"s1":["pop","^ Other questions about Ethan?",{"->":".^.^.17"},null],"#f":5}],"\n","ev","str","^Did he say where the noise was coming from","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Why don't you believe him?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Thank you for your time","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"train.3_8"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.3_7"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.3_1"},"\n",{"#f":5}]}],{"#f":1}],"3_7":["^\"I was irritated about his attitude, so I made a point to stand outside his car to see if I could hear anything. Could not make out a peep, even when that passenger departed at <b>Greencester</b>. Why  someone with his fortune and particularisms wouldn’t book a more private accommodation than ours, I do not understand.\"","\n",{"->":".^.^.3_2"},{"#f":1}],"3_8":["^\"He said the noise was coming from <b>two cars down</b> from him. Seems a little odd if you ask me\"","\n",{"->":".^.^.3_2"},{"#f":1}],"3_3":["^\"Ms. Baker? She seems like a nice lady, if a little odd. You might get along with her actually. She ha a little flower shop, which sells all kinds of unique breeds. Apparently she is quite well known for her varieties. She even gave me a flower as a sample, how nice is that?\"","\n",{"->":".^.^.3_1"},{"#f":1}],"3_4":["^\"Mr. Herbert. He owns that bank doesn't he? What was it called.... oh Goldleaf Financial. Between you an me, I can't stand men like that. Greedy to their core! My friend had great trouble with that bank.\"","\n","^Bankers do tend to be greedy, but could he be greedy enough to steal success from others?","\n",{"->":".^.^.3_1"},{"#f":1}],"3_5":["^\"Dr. Finch. She seems a like a nice enough lady. Didn't talk to her much though, she seemed pre-occupied with something\"","\n",{"->":".^.^.3_1"},{"#f":1}],"3_6":["^\"I searched the train as best as I could for now, and couldn't see anything. We will do a deep clean of the train after you depart. If there is anything else to be found it will be found the, so I will call you if we come up with anything\"","\n","^Your stop at Riverside is still a ways away. You should get all the information you can before then. From your conversations with the staff members, you should be able to piece together who departed at what stations and what car they each stayed in.","\n","^If you think you have completed this information, click the \"I solved it!\" button on the right side of the page. Otherwise you should keep talking to other staff members.","\n",{"->":".^.^.3_1"},"^Move to a new part of the train","\n",{"#f":1}],"exits":[{"temp=":"go_back_to"},["ev","str","^Sleeping Car","/str",{"VAR?":"location"},{"VAR?":"SLEEPING_CAR"},"!=","/ev",{"*":".^.c-0","flg":5},"ev","str","^Engine","/str",{"VAR?":"location"},{"VAR?":"ENGINE"},"!=","/ev",{"*":".^.c-1","flg":5},"ev","str","^Dining Car","/str",{"VAR?":"location"},{"VAR?":"DINING_CAR"},"!=","/ev",{"*":".^.c-2","flg":5},"ev","str","^Corridor","/str",{"VAR?":"location"},{"VAR?":"CORRIDOR"},"!=","/ev",{"*":".^.c-3","flg":5},{"c-0":["^ ",{"->":"train.sleeping_car"},"\n",{"#f":5}],"c-1":["^ ",{"->":"train.engine"},"\n",{"#f":5}],"c-2":["^ ",{"->":"train.dining_car"},"\n",{"#f":5}],"c-3":["^ ",{"->":"train.corridor"},"\n",{"->":"go_back_to","var":true},{"#f":5}]}],{"#f":1}],"#f":1}],"FINAL":[["^<h1><i>The Mystery Concludes!/i></h1>","\n","^After a long, tiring morning, you finally arrive back home in Riverside. You look over the notes you collected on the train again. There must be something here that can help you solve this mystery. You are a researcher after all, you should be able to figure this out!","\n","^Just as you are thinking this you hear the phone ring.","\n","ev","str","^Answer the phone","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","\n","^\"Hello, can you hear me? \"","\n","^It's Katrina!","\n","^\"I just did a thorough cleaning of all the cars. I unfortunately did not find your briefcase, but I did notice a pen in car 2. I didn’t think much of it at first, but then I saw that it was from Riverside University. That is your university right? You almost certainly left it in your briefcase and it must have fell out when whoever stole it was rifling through your research. “","\n","^That's it! Whoever was in car 2 must have been the one to take your briefcase. Luckily now you know who that is and what station they got off at. Looking at your notes, it seems Ethan Owen was sleeping in car 2 and got off at Seastead. It's time for a confrontation!","\n",{"->":"FINAL.seastead"},{"#f":5}]}],{"seastead":[[["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^The train to Seastead is a relatively short one, compared the the wild night you had before. Luckily for you, the Owen residence is easily identifiable. You approach the door. ",{"->":".^.^.17"},null],"s1":["pop",{"->":".^.^.17"},null],"#f":5}],"\n","ev","str","^Ring the doorbell","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Open the door","/str",{"CNT?":".^.c-0"},"/ev",{"*":".^.c-1","flg":21},{"c-0":["^ ","\n","^As you ring the door bell, a curt voice answers through the intercom, \"Owen Residence, to what business do you have?\"","\n","^\"I am here to see Ethan Owen, we have important business regarding the Wild Rose train,\" you tell the stranger behind the door. Hopefully, they let you in. You didn't think of a backup plan here. After a couple of minutes you hear a muffled argument in the residence, but the intercom turns back on.","\n","^\"Ethan Owen will see you know,\" it tell you. You hear a click of the door unlocking.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["^ ",{"->":"FINAL.confrontation"},"\n",{"#f":5}]}],{"#f":1}],"confrontation":[["^You enter the house into the living room, to see a very prim and calm Ethan sitting with a cup of tea in his hand.","\n","^\"Hello, I believe I recognize you from the train last night. To what do I owe the pleasure of your visit?\" he asks you.","\n","ev","str","^\"What do you know about plant research?\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"Did you accidentally take the wrong luggage home?\"","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^\"You took my briefcase!\"","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ","\n","^You know the best approach is to get him talking about related subjects, and see if he lets anything slip. Clearly if he has taken your research, he must be somewhat interested in the topic, right?","\n","^\"Well since you are asking, I have gotten into the study of plants somewhat recently,\" he tells you. \"Particularly, I have become interested in plants for their medicinal properties. For example, the Echinacea plant I have here.\" He picks up a small plant on the coffee table. You can tell immediately that this is not Echinacea but, in fact, Basil. Clearly Ethan doesn't know anything about plants like he claims he does.","\n",{"->":"FINAL.confession"},{"#f":5}],"c-1":["\n","^You know the best approach is to not accuse him of anything, and see if he would just return your research without a fuss.","\n","^When you ask him about the luggage, you see a look of panic briefly cross his face before he controls it.","\n","^\"I am afraid you have the wrong person. I assure you anything I took off the train was mine.\" he tells you in a voice as calm as ever. Clearly he is not willing to open up about taking your briefcase without some pressure.","\n",{"->":"FINAL.confession"},{"#f":5}],"c-2":["\n","^You know that the best approach is to confront him directly.","\n","^\"You know why I am here,\" you tell him. \"You stole my briefcase last night!\"","\n","^\"I know of no such thing\" he tells you calmly sipping from his tea. Clearly the direct approach isn't going to work.","\n",{"->":"FINAL.confession"},{"#f":5}]}],{"#f":1}],"confession":["^Your last attempt didn't work. You are going to have pull out all the stop if you want to get your research back.","\n","^\"I know that you stole my briefcase last night. There is indisputable proof on the train. I am just here to give you a chance to return it, before I involve the police!\" you tell him. You aren't sure that a pen would hold up in court, but he doesn't need to know that.","\n","^\"Fine. I was the one to take your briefcase,\" he tells you. \"People don’t realize how hard it is to be the 3rd child in a family like mine. I won’t inherit the Owen title, like my oldest brother, and I certainly am not the genius that Henry is. Father keeps telling me to `do something with my life.’ Which isn’t fair at all, I have done plenty with my life. I play pool with the governor’s son!  But alas, father says I need to do something worthy of our house, and a discovery such as yours would surely outshine Henry. But you have me found out, so here it is. We can put this whole thing behind us, yes? “","\n","end",{"#f":1}],"#f":1}],"global decl":["ev",{"list":{},"origins":["location"]},{"VAR=":"location"},"/ev","end",null],"#f":1}],"listDefs":{"location":{"SLEEPING_CAR":1,"ENGINE":2,"DINING_CAR":3,"CORRIDOR":4,"NO_WHERE":5}}}